# 함수 적용
## 데이터에 함수적용(apply)

In [1]:
import pandas as pd
df = pd.read_excel('score.xlsx', index_col='지원번호')
df

       이름   학교    키   국어   영어   수학  과학  사회        SW특기
지원번호
1번    채치수  북산고  197   90   85  100  95  85      Python
2번    정대만  북산고  184   40   35   50  55  25        Java
3번    송태섭  북산고  168   80   75   70  80  75  Javascript
4번    서태웅  북산고  187   40   60   70  75  80         NaN
5번    강백호  북산고  188   15   20   10  35  10         NaN
6번    변덕규  능남고  202   80  100   95  85  80           C
7번    황태산  능남고  188   55   65   45  40  35      PYTHON
8번    윤대협  능남고  190  100   85   90  95  95          C#

In [2]:
def add_cm(height) :
    return str(height)+'cm'

df['키'] = df['키'].apply(add_cm)

In [3]:
df

       이름   학교      키   국어   영어   수학  과학  사회        SW특기
지원번호
1번    채치수  북산고  197cm   90   85  100  95  85      Python
2번    정대만  북산고  184cm   40   35   50  55  25        Java
3번    송태섭  북산고  168cm   80   75   70  80  75  Javascript
4번    서태웅  북산고  187cm   40   60   70  75  80         NaN
5번    강백호  북산고  188cm   15   20   10  35  10         NaN
6번    변덕규  능남고  202cm   80  100   95  85  80           C
7번    황태산  능남고  188cm   55   65   45  40  35      PYTHON
8번    윤대협  능남고  190cm  100   85   90  95  95          C#

In [4]:
def capitalize(lang) :
    if pd.notnull(lang) :
        return lang.capitalize() # 첫글자만 대문자로 나머지는 소문자로
    return lang

df['SW특기'] = df['SW특기'].apply(capitalize)

In [5]:
df

       이름   학교      키   국어   영어   수학  과학  사회        SW특기
지원번호
1번    채치수  북산고  197cm   90   85  100  95  85      Python
2번    정대만  북산고  184cm   40   35   50  55  25        Java
3번    송태섭  북산고  168cm   80   75   70  80  75  Javascript
4번    서태웅  북산고  187cm   40   60   70  75  80         NaN
5번    강백호  북산고  188cm   15   20   10  35  10         NaN
6번    변덕규  능남고  202cm   80  100   95  85  80           C
7번    황태산  능남고  188cm   55   65   45  40  35      Python
8번    윤대협  능남고  190cm  100   85   90  95  95          C#

In [6]:
df['SW특기'].str.capitalize()

지원번호
1번        Python
2번          Java
3번    Javascript
4번           NaN
5번           NaN
6번             C
7번        Python
8번            C#
Name: SW특기, dtype: object

In [7]:
df

       이름   학교      키   국어   영어   수학  과학  사회        SW특기
지원번호
1번    채치수  북산고  197cm   90   85  100  95  85      Python
2번    정대만  북산고  184cm   40   35   50  55  25        Java
3번    송태섭  북산고  168cm   80   75   70  80  75  Javascript
4번    서태웅  북산고  187cm   40   60   70  75  80         NaN
5번    강백호  북산고  188cm   15   20   10  35  10         NaN
6번    변덕규  능남고  202cm   80  100   95  85  80           C
7번    황태산  능남고  188cm   55   65   45  40  35      Python
8번    윤대협  능남고  190cm  100   85   90  95  95          C#

# 14.그룹화

### 동일한 값을 가진 것들끼리 합쳐서 통계 또는 평균 등의 값을 계산하기 위해 사용

In [8]:
df

       이름   학교      키   국어   영어   수학  과학  사회        SW특기
지원번호
1번    채치수  북산고  197cm   90   85  100  95  85      Python
2번    정대만  북산고  184cm   40   35   50  55  25        Java
3번    송태섭  북산고  168cm   80   75   70  80  75  Javascript
4번    서태웅  북산고  187cm   40   60   70  75  80         NaN
5번    강백호  북산고  188cm   15   20   10  35  10         NaN
6번    변덕규  능남고  202cm   80  100   95  85  80           C
7번    황태산  능남고  188cm   55   65   45  40  35      Python
8번    윤대협  능남고  190cm  100   85   90  95  95          C#

In [9]:
df.groupby('학교')

In [10]:
df.groupby('학교').get_group('북산고')

       이름   학교      키  국어  영어   수학  과학  사회        SW특기
지원번호
1번    채치수  북산고  197cm  90  85  100  95  85      Python
2번    정대만  북산고  184cm  40  35   50  55  25        Java
3번    송태섭  북산고  168cm  80  75   70  80  75  Javascript
4번    서태웅  북산고  187cm  40  60   70  75  80         NaN
5번    강백호  북산고  188cm  15  20   10  35  10         NaN

In [12]:
df.groupby('학교').mean() # 북산고 학생들의 평균점수만 출력

            국어         영어         수학         과학    사회
학교
능남고  78.333333  83.333333  76.666667  73.333333  70.0
북산고  53.000000  55.000000  60.000000  68.000000  55.0

In [13]:
df.groupby('학교').size() # 각 그룹의 크기

학교
능남고    3
북산고    5
dtype: int64

In [14]:
df.groupby('학교').size()['능남고'] #능남고의 데이터 수만 확인 가능

3

In [16]:
df.groupby('학교')['국어'].mean()

학교
능남고    78.333333
북산고    53.000000
Name: 국어, dtype: float64

In [18]:
df.groupby('학교')[['국어','수학','영어']].mean()

            국어         수학         영어
학교
능남고  78.333333  76.666667  83.333333
북산고  53.000000  60.000000  55.000000

In [19]:
df.['학년'] = [3,3,2,1,1,3,2,2]

SyntaxError: invalid syntax (1026748062.py, line 1)

In [20]:
df['학년'] = [3,3,2,1,1,3,2,2]

In [21]:
ㅇㄹ

NameError: name 'ᄋᄅ' is not defined

In [22]:
df

       이름   학교      키   국어   영어   수학  과학  사회        SW특기  학년
지원번호
1번    채치수  북산고  197cm   90   85  100  95  85      Python   3
2번    정대만  북산고  184cm   40   35   50  55  25        Java   3
3번    송태섭  북산고  168cm   80   75   70  80  75  Javascript   2
4번    서태웅  북산고  187cm   40   60   70  75  80         NaN   1
5번    강백호  북산고  188cm   15   20   10  35  10         NaN   1
6번    변덕규  능남고  202cm   80  100   95  85  80           C   3
7번    황태산  능남고  188cm   55   65   45  40  35      Python   2
8번    윤대협  능남고  190cm  100   85   90  95  95          C#   2

In [23]:
df.groupby(['학교','학년']).mean() # 학교별, 학년별 평균데이터

          국어     영어    수학    과학    사회
학교  학년
능남고 2   77.5   75.0  67.5  67.5  65.0
    3   80.0  100.0  95.0  85.0  80.0
북산고 1   27.5   40.0  40.0  55.0  45.0
    2   80.0   75.0  70.0  80.0  75.0
    3   65.0   60.0  75.0  75.0  55.0

In [24]:
df.groupby('학년').mean()

           국어         영어         수학         과학         사회
학년
1   27.500000  40.000000  40.000000  55.000000  45.000000
2   78.333333  75.000000  68.333333  71.666667  68.333333
3   70.000000  73.333333  81.666667  78.333333  63.333333

In [25]:
df.groupby('학년').mean().sort_values('국어') # 학년별로 키 그룹화 후 국어성적 오름차순대로 정렬

           국어         영어         수학         과학         사회
학년
1   27.500000  40.000000  40.000000  55.000000  45.000000
3   70.000000  73.333333  81.666667  78.333333  63.333333
2   78.333333  75.000000  68.333333  71.666667  68.333333

In [26]:
df.groupby('학교')['SW특기'].count() #NaN 빼고 조회

학교
능남고    3
북산고    3
Name: SW특기, dtype: int64

In [28]:
df.groupby('학교')[['이름','SW특기']].count()

     이름  SW특기
학교
능남고   3     3
북산고   5     3

In [29]:
school = df.groupby('학교')
school['학년'].value_counts() #학교로 그룹화를 한 뒤에 학년별 학생 수를 가져옴

학교   학년
능남고  2     2
     3     1
북산고  1     2
     3     2
     2     1
Name: 학년, dtype: int64

In [31]:
school['학년'].value_counts().loc['북산고'] # 학교로 그룹화를 한뒤 북산고에 대해 학년별 학생수를 가져옴

학년
1    2
3    2
2    1
Name: 학년, dtype: int64

In [32]:
school['학년'].value_counts(normalize=True) #퍼센트비율로 바꿔서 보여줌

학교   학년
능남고  2     0.666667
     3     0.333333
북산고  1     0.400000
     3     0.400000
     2     0.200000
Name: 학년, dtype: float64